# ScaleFailures Properties

---
The BuiltInFailuresScaleFailures type exposes the following members.
| Name| Description
---|---|---
| CannotScaleLinkWithSharedCoordinates|  Can't scale link that shares coordinates with host model
Top
#### Reference
BuiltInFailuresScaleFailures Class
Autodesk.Revit.DB Namespace